[
  {
    "title": "Request for Proposal (RFP) for the Fabrication and Supply of School Desks at Plan International",
    "company": "Plan International",
    "location": "Damboa & Mobbar LGAs of Borno",
    "description": "Plan International is an independent development and humanitarian non-profit organization that advances children’s rights and equality for girls. We support children’s rights from birth until they reach adulthood and enable children to prepare for – and respond to – crises and adversity. We believe in the power and potential of every child but know this is often suppressed by poverty, violence, exclusion and discrimination.\n\nWorking together with children, young people, supporters and partners, we strive for a just world, tackling the root causes of the challenges girls and vulnerable children face. We have been building powerful partnerships for children for over 80 years and are now active in more than 70 countries, driving changes in practice and policy at local, national and global levels using our reach, experience and knowledge. Plan International is registered in Nigeria with the Corporate Affairs Commission.",
    "keyResponsibilities": "Plan International is committed to obtaining fair value for services rendered with a competitive price and timely delivery of the right quantities at the right quality. This RFP intends to secure a competitive proposal for the fabrication and supply of School Desks to Damboa and Mobbar LGAs in Borno State.",
    "requiredSkills": "Bids submitted after the deadline date will NOT be accepted. Questions must be sent by email to: TenderInquiry@plan-international.org with the bid reference in the subject. A detailed description of the Request for Proposal can be accessed via this link: CLICK HERE Disclaimer: Plan International does not charge bidders fees for submitting this tender or ask for any form of registration to access our information.",
    "closingDate": "2025-03-26",
    "applicationMethod": "Interested and qualified Vendors should submit sealed bids addressed to: Plan International Nigeria Attention: Head of Supply Chain No 49, Anthony Enahoro Street, Utako District, Abuja, Nigeria.  Bids can also be submitted in soft copies to: Nigeria.procurement@plan-international.org using this reference, \"PIN/CO/025/011’ “ECHO School Desks\" as the subject of the mail.",
    "datePosted": "2025-03-17",
    "id": 1
  },
  {
    "title": "Oando Plc Joint Venture Graduate Acceleration Program (OGAP) 2025",
    "company": "Oando Plc",
    "location": "Nigeria",
    "description": "Oando Plc is one of Africa’s largest integrated energy solutions provider with a proud heritage. It has a primary listing on the Nigeria Stock Exchange and a secondary listing on the Johannesburg Stock Exchange. With shared values of Teamwork, Respect, Integrity, Passion and Professionalism (TRIPP).",
    "keyResponsibilities": "Only shortlisted candidates will be contacted. Oando will not process any application not received through the recruitment platform as shared on our website and official social media pages. Oando is an equal opportunity employer and will consider all qualified candidates. Oando will never request money to support this application or any job application. Please report cases to recruitment@oandoplc.com",
    "requiredSkills": "A Bachelor’s Degree with a minimum of Second Class Upper (2.1) in Engineering, Geosciences, Business Administration, or Economics. Not older than 26 years as of January 1, 2025. Must have completed the National Youth Service Corps (NYSC) program by April 2025. Possess no more than two (2) years of work experience. Achieved a minimum of five (5) B’s and two (2) C’s in WASC, SSCE, or GCE O-Level in a single sitting, including Mathematics and English Language.",
    "closingDate": "Not Specified",
    "applicationMethod": "Interested and qualified candidates should: https://form.typeform.com/to/XyMeVuLm?typeform-source=t.co",
    "datePosted": "2025-03-17",
    "id": 2
  },
  {
    "title": "Cybersecurity Training & Internship Program at Refonte Learning",
    "company": "Refonte Learning",
    "location": "Nigeria",
    "description": "Refonte Learning is an Ed-Tech powerhouse under Refonte Private Limited, offering comprehensive IT training programs. The unique Global Training & Internship Program combines industry-relevant training with real-world project work alongside experienced professionals.",
    "keyResponsibilities": "As a cybersecurity intern, you will be involved in various key activities, including: Vulnerability Analysis & Penetration Testing (Pentesting):  Identify and assess security vulnerabilities in systems and applications. Conduct vulnerability scans and penetration tests (black-box, white-box, grey-box). Prepare security reports and recommendations for mitigation. Infrastructure Security & Incident Management:  Monitor networks and systems for suspicious activities. Analyze security incidents and assist in threat response. Contribute to the implementation and hardening of security policies. Application Security & Secure Development (DevSecOps):  Analyze code for vulnerabilities in web and mobile applications. Integrate security best practices into the software development lifecycle (CI/CD). Automate security testing using scripts and specialized tools. Compliance & Regulatory Standards:  Study and apply cybersecurity standards and frameworks (ISO 27001, NIST, GDPR, etc.). Assist in drafting security policies and procedures. Participate in internal and external security audits. Research & Awareness Initiatives:  Stay up to date with emerging threats, malware, and attack techniques. Develop training materials and awareness programs on cybersecurity. Take part in cybersecurity conferences and challenges (CTF, Hackathons).",
    "requiredSkills": "Currently pursuing a Bachelor's or Master's degree in Computer Science, Cybersecurity, Networks, or a related field. Desired Profile:  We are looking for passionate, curious, and motivated individuals eager to learn in a fast-paced cybersecurity environment. Technical Skills:  Cybersecurity fundamentals: network security, cryptography, identity & access management. Programming/Scripting knowledge: Python, Bash, PowerShell, JavaScript, etc. Operating systems expertise: Windows, Linux, and system hardening techniques. Cybersecurity tools: Wireshark, Metasploit, Burp Suite, Nmap, Snort, Nessus, etc. Network security & protocols: TCP/IP, VPN, Firewalls, IDS/IPS. Understanding of penetration testing methodologies (OWASP, MITRE ATT&CK). Soft Skills:  Strong analytical and problem-solving abilities. Attention to detail, autonomy, and ability to handle security incidents under pressure. Excellent communication and ability to explain technical concepts clearly. Strong teamwork and adaptability to new technologies.",
    "closingDate": "Not Specified",
    "applicationMethod": "Interested and qualified candidates should send their CV and a Cover Letter to: murielle@refontelearning.co using the Job Title as the subject of the email.",
    "datePosted": "2025-03-17",
    "id": 3
  },
  {
    "title": "Healthcare Provider at a Reputable Healthcare Company",
    "company": "Reputable Healthcare Company",
    "location": "Nigeria",
    "description": "We recognize the potential of the growing health industry and therefore, we ventured into general hospital, pharmaceutical, and laboratories.",
    "keyResponsibilities": "Conduct routine check-ups to patients to assess their health condition and discover possible issues Give appropriate advice for healthy habits and preventative actions to promote overall health Conduct examinations to ill patients and evaluate symptoms to determine their condition Ask intuitive questions to discover causes of illness Reach an informed diagnosis based on scientific knowledge and the patient’s medical history Prescribe and interpret lab tests to obtain more information for underlying infections or abnormalities Prescribe medications or drugs and provide comprehensive instructions for administration Collaborate with other physicians, physician assistants and nurses to form a high performing medical team Examine and provide treatments to injuries and refer patients to other physicians when needed Keep records of patients’ diseases, operations or other significant information",
    "requiredSkills": "Proven experience as a healthcare provider Strong understanding of examination methodologies and diagnostics Excellent knowledge of infectious diseases, their symptoms and epidemiology Broad knowledge of common medication, side effects and contraindications In-depth knowledge of legal medical guidelines and medicine best practices Excellent oral and written communication skills Respect for patient’s confidentiality Compassionate and approachable Responsible and trustworthy.",
    "closingDate": "2025-04-15",
    "applicationMethod": "Interested and qualified candidates should send their Applications to: stalsolbakken@gmail.com using the Job Title as the subject of the mail.",
    "datePosted": "2025-03-17",
    "id": 4
  },
  {
    "title": "Refonte Learning Business Analytics Training & Internship Program",
    "company": "Refonte Learning",
    "location": "Nigeria",
    "description": "Refonte Learning is a dynamic Ed-Tech division of Refonte Private Limited, dedicated to empowering individuals and businesses in the digital age. We offer industry-relevant IT training programs in Python, SQL, Tableau, and Advanced Excel, along with hands-on projects and internships through our unique Global Training & Internship Program (OGTIP). Additionally, we provide cutting-edge digital marketing solutions to help businesses achieve their growth objectives.",
    "keyResponsibilities": "Working with data science experts to gather, clean, and analyze large datasets Utilizing machine learning and data mining techniques to extract insights Applying Python for Exploratory Data Analysis (EDA) in Real-World Business Situations Designing scientific tests and enhancing model performance Creating machine learning pipelines for various use cases Analyzing business data, forming hypotheses, and evaluating the impact of strategies Developing innovative solutions using modeling technologies",
    "requiredSkills": "Currently enrolled in a degree program, demonstrating a commitment to continuous learning Excellent written and verbal communication skills Capable of working independently as well as collaboratively within a team Highly adaptable with strong teamwork skills.",
    "closingDate": "Not Specified",
    "applicationMethod": "Interested and qualified candidates should send their Applications to: murielle@refontelearning.co using the job title as the subject of the mail.",
    "datePosted": "2025-03-17",
    "id": 5
  }
]